# PACMAN packages — core (una línea por paquete, # = comentario)
# Sin AUR. Todo desde repos oficiales (Core/Extra/Multilib).

# Hyprland ecosystem
hyprland
hyprlock
hypridle
hyprpaper
hyprpolkitagent
hyprpicker
hyprcursor
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk
qt5-wayland
qt6-wayland

# Shell (quickshell reemplaza waybar/mako/fuzzel/wlogout)
quickshell
qt6-svg            # SVG icons en quickshell (requerido para IconImage)
qt6-imageformats   # WEBP y formatos extra en quickshell
qt6-5compat        # gaussian blur y efectos en quickshell

# Terminal / Editor
kitty
neovim

# Screenshot / Clipboard
grim
slurp
swappy             # anotación de screenshots (opcional, reemplaza satty)
wl-clipboard
cliphist

# Launcher (reclasificado desde AUR — está en Extra)
fuzzel             # TODO: migrar a popup de quickshell

# Audio
pipewire
pipewire-pulse
pipewire-alsa
wireplumber
pavucontrol
pamixer
playerctl

# Brightness / Network / Bluetooth
brightnessctl
networkmanager
network-manager-applet
bluez
bluez-utils
blueman

# Theme / Appearance
nwg-look
qt5ct
qt6ct
kvantum
papirus-icon-theme # reclasificado desde AUR (estética KDE)

# File Manager
thunar
gvfs
tumbler
yazi

# Fonts (de repos oficiales — sin AUR)
inter-font
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-jetbrains-mono  # fuente principal (reemplaza Maple Mono NF)
ttf-nerd-fonts-symbols  # glifos Nerd Font vía fallback de fontconfig

# Shell / CLI
zsh
starship
fzf
ripgrep
fd
bat
eza
zoxide
git-delta
btop
bottom
dust
duf
tealdeer
procs
jq
glow
fastfetch
tmux
direnv
just
atuin             # reclasificado desde AUR (historial de shell)

# Dev
git
base-devel
lazygit
github-cli
mise
rustup

# Display manager
greetd
greetd-tuigreet

# Misc
polkit
stow
wf-recorder
